tutorials/fluidSolidInteraction/3dTube/viscoElastic3dTube/Allrun
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication -l log.blockMesh.solid blockMesh -region solid
runApplication -l log.setSet.solid setSet -region solid -batch setBatch.solid
runApplication -l log.setsToZones.solid setsToZones -region solid -noFlipMap

runApplication -l log.blockMesh.fluid blockMesh -region fluid
runApplication -l log.setSet.fluid setSet -region fluid -batch setBatch.fluid
runApplication -l log.setsToZones.fluid setsToZones -region fluid -noFlipMap

# Run serial
runApplication solids4Foam

# Run parallel
#runApplication -l log.decomposeParFsi.fluid decomposeParFsi -region fluid
#runApplication -l log.decomposeParFsi.solid decomposeParFsi -region solid
#runParallel solids4Foam 3

# ----------------------------------------------------------------- end-of-file

